package extra.if_else_switch.task;

import java.util.Scanner;

/**
 * Написать программу, которая считывает год введенный пользователем,
 * и определяет, является ли этот год високосным.
 * Год считается високосным, если он делится без остатка на
 * на 4. Однако, если год также делится на 100,
 * то этот год не високосный, за исключением годов,
 * делящихся на 400.
 */
public class Task4 {
    public static void main(String[] args) {
//        System.out.println("Enter the year: ");
//        Scanner scanner = new Scanner(System.in);
//        int year = scanner.nextInt();
//
//        if (year%400==0||(year%4==0&&year%100!=0)){
//            System.out.println(year+ " leap year");
//        }else {
//            System.out.println(year+ " not leap year");
//        }
    }
}
